{"educations":{"_total":2,"values":[{"degree":"Electrical Engineering","endDate":{"year":2013},"fieldOfStudy":"Computer Science Minor","id":88392881,"notes":"- Specialized on networking and distributed systems within computer science\n- Worked in a technical capacity at a college radio station (wpgu), helping set up their software stack and infrastructure","schoolName":"University of Illinois at Urbana-Champaign","startDate":{"year":2011}},{"degree":"Bachelor of Science","endDate":{"year":2011},"fieldOfStudy":"Electrical Engineering","id":138479923,"schoolName":"Manipal University, ICAS","startDate":{"year":2009}}]},"firstName":"Tushar","lastName":"Bhushan","location":{"name":"San Francisco Bay Area"},"pictureUrl":"https://media.licdn.com/mpr/mprx/0_Wn8k2260hpOeP035d9rU27FACUJQAJ35wlNR2mnSgYDBag9LLKKeCaG_uzMZtOhWevCsideHwYrW","positions":{"_total":8,"values":[{"company":{"id":504748,"industry":"Information Technology and Services","name":"SendGrid","size":"201-500 employees","type":"Privately Held"},"id":705048930,"isCurrent":true,"startDate":"Aug 2015","summary":"• Creating technical content for publication for the company blog and other channels to show developers how to implement specific solutions or use new technologies.\n• Organizing and volunteering at local, national, and international developer events.\n• Speaking and sharing my expertise at user groups and conferences.\n• Educating and empowering developers, giving technical workshops and brown bags.\n• Writing production-quality code and contributing to Sendgrids's open source helper libraries and other projects.\n• Building partnerships with individuals, companies and organizations that serve the developer community.\n• Connecting and networking with other developers and entrepreneurs to identify how Sendgrid might help them be even more awesome.\n• Gathering and socializing product feedback that will inform engineering, sales, and marketing decision making.\n• Supporting our developers wherever they are, on forums, social media, and everywhere in between.","title":"Developer Evangelist","endDate":"present"},{"company":{"id":2612487,"industry":"Internet","name":"Keen IO","size":"11-50 employees","type":"Privately Held"},"endDate":"Jul 2015","id":665244421,"isCurrent":false,"startDate":"May 2015","summary":"• Contributed to open source projects both internal and external (Internal: Keen-PythonClient External: Ghost)\n• Co-authored blog posts for the company blog to better explain how to use the product effectively\n• Developed a means to track to the effectiveness of developer evangelism built with express.js and firebase\n• Worked on product support to answer customer questions and surface issues/feature requests to the relevant team","title":"Open Source Developer"},{"company":{"id":1288,"industry":"Internet","name":"Yahoo","size":"10,001+ employees","ticker":"YHOO","type":"Public Company"},"endDate":"Mar 2015","id":500761168,"isCurrent":false,"startDate":"Dec 2013","summary":"• Identify the priority and criticality of incoming alerts and prioritize appropriately\n• Diagnose & repair issues using critical knowledge of Apache, UNIX processes, MySQL and related technologies within the OSI stack.\n• Track issues through the ticketing systems and follow through to resolution\n• Utilize monitoring tools to proactively identify issues and trends\n• Write clear and concise operational runbooks\n• Escalate significant issues to service, network or other operations engineers \n• Lead by example, deliver results and eliminate missed opportunities\n• Work with new technologies such as HIVE, Oozie, Hadoop, HBase etc., that work on distributed system technologies","title":"Service Engineer"},{"company":{"id":1288,"industry":"Internet","name":"Yahoo","size":"10,001+ employees","ticker":"YHOO","type":"Public Company"},"endDate":"Aug 2013","id":420981289,"isCurrent":false,"startDate":"Jul 2013","summary":"• Designed, implemented, tested, and deployed new data processing algorithms according to requirements specifications\n• Investigated and compared infrastructural changes for improved performance and data throughput\n• Designed database schemas and reports used to meet the company’s ongoing business demands \n• Familiarized myself with design, implementation and performance of file-systems, content delivery and large-scale distributed systems\n• Familiarized myself with NFS, HTTP, TCP/IP as well as with the entire Hadoop tools ecosystem (PIG, HDFS, HBASE, etc.) \n• Learned in-detail the day-to-day lifecycle of a new product, from beginning to end, and working with a large codebase","title":"Technical Intern"},{"company":{"name":"WPGU Radio"},"endDate":"Jun 2013","id":364156242,"isCurrent":false,"startDate":"Feb 2013","summary":"Brand development, web site traffic growth and advertising. Maintained and analyzed social media traffic and ROI (return on investment). Worked on integrating social media aspects to the website.","title":"Social Media Intern"},{"company":{"name":"oSTEM"},"endDate":"Dec 2011","id":347530281,"isCurrent":false,"startDate":"Nov 2011","summary":"Built a robot to manoeuvre through a course picking up/depositing objects and performing similar\ntasks\nDesigned a basic working arm for the robot to accomplish aforementioned tasks\nReviewed the design; Programming logistics;\nSQL Based Web Application","title":"Jerry Sander’s Creative Competition"},{"company":{"name":"College Magazine - Manipal University"},"endDate":"Jun 2011","id":347530282,"isCurrent":false,"startDate":"Aug 2010","summary":"Organised editorial board meetings Manipal University, Manipal\nSupervised the editorial team, consisting of 4 senior and 4 junior members\nPublished the official college magazine for 2011\nInterfaced with foreign universities to acquire funding","title":"Editor-in-Chief"},{"company":{"name":"College Magazine - Manipal University"},"endDate":"Jul 2010","id":347530283,"isCurrent":false,"startDate":"Aug 2009","summary":"Contributed to the official magazine Manipal University, Manipal\nProofread and edited articles","title":"Editorial Board Member"}]},"projects":{"_total":4,"values":[{"description":"-Designed and Implemented a working MapReduce implementation\n-Implemented a distributed grep protocol to aid in testing\n-Designed and implemented a failure detection mechanism based around a modified ring failure detection protocol\n-Designed and implemented a distributed file system along with replication control mechanisms","id":2,"name":"Distributed Systems (MapReduce/Hadoop)"},{"description":"A Spotify app that would provide synced guitar tabs to help play along with your favorite songs.","id":38,"name":"Tabify","url":"https://github.com/pagrawl3/fbHack2013"},{"description":"Implemented a Sliding Window Protocol and simulated TCP over a UDP connection (which occasionally dropped packets) in C. The Sliding Window ensured reliable transmission using acknowledgements (ACKs) for received packets. Also implemented Congestion Control in order to reliably transmit packets in case of bandwidth congestion by adjusting the size of the sliding window dynamically based on the level of congestion on the network.","id":104,"name":"Implementing TCP over UDP","url":"https://github.com/mrlevitas/cs438/tree/master/MP3"},{"description":"- Developed from the ground up, a framework to visualize the key performance metrics of several pipelines running at Yahoo! on the Hadoop grid\n- Provided significant insights into how code changes or outages have affected job performance on the grid.\n- Worked from the design of the architecture all the way to its complete implementation\n- Performed data collection and modeling using python and mysql \n- Developed a backend server using node.js/express.js\n- Used the bootstrap framework along with Jade (templating) to implement an easy to use UI, as well as ensure a responsive design (mobile-friendly)\n- Implemented Highcharts/d3.js to visualize the data being collected\n- Wrote unit tests for each of the components listed above using the mocha/chai testing framework.","id":500761172,"name":"Visualizing hadoop/mapreduce performance metrics"}]}}